docs/blog/20200410.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-02-02 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Outsource Repository Concept</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Cem Keylan">
<link rel="stylesheet" type="text/css" href="/style.css">
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar">
    <a href="/" class=navbartitle>Carbs Linux</a>

    <label for="hamburger">&#9776;</label>
    <input type="checkbox" id="hamburger" />
    <ul id=navbarlist>
        <li><a href="/" title="Home Page">Home</a></li>
        <li><a href="//git.carbslinux.org" title="Git Repository">Git</a></li>
        <li><a href="/download.html" title="Download Carbs Linux">Download</a></li>
        <li><a href="/blog" title="Blog Posts">Blog</a></li>
        <li><a href="/install.html" title="Installation Instructions">Installation</a></li>
        <li><a href="/docs.html" title="Documentation">Docs</a></li>
    </ul>
</nav>
</div>
<div id="content">
<header>
<h1 class="title">Outsource Repository Concept</h1>
<p class="subtitle">posted on 2020-04-10</p>
</header><p>
In April 3rd, I have added submodule support for Carbs Linux's fork of <code>kiss</code>.
Now, from that sentence, it really doesn't sound exciting at all. But in
reality, it opens a path to lots of creative output, and a better way to manage
multi-user repositories (such as KISS Community).
</p>

<p>
When managing a repository of submodules, the repository maintainer's only job
is to deal with adding packages. A package maintainer doesn't have to wait for
the repository maintainer to update their packages, as they are only making the
changes to their own repositories.
</p>

<p>
This way, an end-user can also track from their preferred maintainers, and do
that with the tidyness of a single repository in their <code>KISS_PATH</code>.
</p>

<p>
Carbs Linux now has an outsource repository for some packages. Firefox and its
dependencies have been purged from the main repository, but can be found on it.
</p>

<p>
<a href="https://github.com/CarbsLinux/outsource">https://github.com/CarbsLinux/outsource</a>
</p>
</div>
<div id="postamble" class="status">
<footer>
    <p>Linux&reg; is a registered trademark of Linus Torvalds</p>
    <p>Copyright &copy; 2019-2021 Cem Keylan</p>
</footer>
</div>
</body>
</html>
